#6.4. 셋째, 통계학의 관측된 데이터가 가능한 여러 값 중 하나라고 생각한다.(107~111p)(6_1_1 수면제 예제/sleep데이터활용)
#[한 줄 요약] 관측된 데이터들만으로 모든 것을 확언하는게 아니라는 것이다? 

#초기의 값 설정
curve(dnorm(x, 0, 1.8),-4,4)
options(digits=3)
set.seed(1606)

#===최초 시뮬레이션 실행(검증위해 총 3번 실시하는 코드)=====================================
(y_star <- rnorm(10,0,1.8))
mean(y_star-0);sd(y_star)
(t_star <-mean(y_star-0)/ (sd(y_star)/sqrt(length(y_star))))

# 위의 코드들을 실행
#> (y_star <- rnorm(10,0,1.8))
#[1]  0.05  1.02 -1.83  0.60 -1.69  3.43 -2.11 -1.43  3.66  2.02
#> mean(y_star-0);sd(y_star)
#[1] 0.372   #mean(y_star-0) : 평균 수면시간을 뜻한다.
#[1] 2.16    #sd(y_star) : 표본표준편차
#> (t_star <-mean(y_star-0)/ (sd(y_star)/sqrt(length(y_star))))
#[1] 0.546   #t-통계량 값 : 0.546


#===(검증위해 2차로 시뮬레이션 실시하는 코드)==============================================
(y_star <-rnorm(10,0,1.8))
mean(y_star-0);sd(y_star)
(t_star <-mean(y_star-0)/ (sd(y_star)/sqrt(length(y_star))))

#2차 코드를 실시하면 아래와 같다.
#> (y_star <-rnorm(10,0,1.8))
#[1]  1.6091 -1.3576  2.0493 -2.1809 -0.5280  1.8927  0.5539 -0.0879  3.1078 -0.8849
#> mean(y_star-0);sd(y_star)
#[1] 0.417
#[1] 1.71
#> (t_star <-mean(y_star-0)/ (sd(y_star)/sqrt(length(y_star))))
#[1] 0.773


#===(검증위해 3차로 시뮬레이션 실시하는 코드)==============================================
(y_star <-rnorm(10,0,1.8))
mean(y_star-0); sd(y_star)
(t_star <-mean(y_star-0) / (sd(y_star)/sqrt(length(y_star))))

#> (y_star <-rnorm(10,0,1.8))
#[1] -0.4769 -0.7535  1.0582  2.3119  1.7724 -0.0445 -2.9943  1.7512 -1.5613  2.6686
#> mean(y_star-0); sd(y_star)
#[1] 0.373
#[1] 1.84
#> (t_star <-mean(y_star-0) / (sd(y_star)/sqrt(length(y_star))))
#[1] 0.64

#===============================================================================

#최초, 2차, 3차 시뮬레이션 실시할 때마다 똑같은 코드임에도 나오는 값이 다르다.
#